## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.terraform_access: Refreshing state... [id=2ffac8d1a1e85232461425b441d27bce00a220c3]
data.cloudflare_api_token_permission_groups.all: Reading...
cloudflare_record.mx-1: Refreshing state... [id=01b1e5831a61d592bb2a1fb51fc40a47]
cloudflare_record.mx-2: Refreshing state... [id=7539dc716260bb768658d6b61e54740e]
cloudflare_zone_settings_override.tmeit-se-settings: Refreshing state... [id=6a806c0199e15cdf23bb3017a90bf149]
hcloud_firewall.myfirewall: Refreshing state... [id=572118]
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]
data.cloudflare_api_token_permission_groups.all: Read complete after 0s [id=37f58c2e50041f9eed30c0006b111b44]
hcloud_server.node1: Refreshing state... [id=24978813]
cloudflare_api_token.dns_validation_token2: Refreshing state... [id=9657156ad127d069d744b9c513de93e3]
cloudflare_record.root-aaaa: Refreshing state... [id=eec58a7b6d17f1a40f411efb35d4da22]
hcloud_rdns.node1_ipv6: Refreshing state... [id=s-24978813-2a01:4f9:c012:6063::1]
cloudflare_record.www-aaaa: Refreshing state... [id=9f7b0d63a18b5513abb8db23ce62cd46]
hcloud_rdns.node1_ipv4: Refreshing state... [id=s-24978813-65.21.188.62]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # b2_application_key.database-backup will be created
  + resource "b2_application_key" "database-backup" {
      + application_key    = (sensitive value)
      + application_key_id = (known after apply)
      + bucket_id          = (known after apply)
      + capabilities       = [
          + "listFiles",
          + "readFiles",
          + "writeFiles",
        ]
      + id                 = (known after apply)
      + key_name           = "database-backup"
      + options            = (known after apply)
    }

  # b2_bucket.db-backups will be created
  + resource "b2_bucket" "db-backups" {
      + account_id  = (known after apply)
      + bucket_id   = (known after apply)
      + bucket_name = "tmeit-db-backups"
      + bucket_type = "allPrivate"
      + id          = (known after apply)
      + options     = (known after apply)
      + revision    = (known after apply)

      + default_server_side_encryption {
          + algorithm = "AES256"
          + mode      = "SSE-B2"
        }

      + file_lock_configuration {
          + is_file_lock_enabled = true

          + default_retention {
              + mode = "compliance"

              + period {
                  + duration = 14
                  + unit     = "days"
                }
            }
        }

      + lifecycle_rules {
          + days_from_hiding_to_deleting = 14
          + file_name_prefix             = "tmeit-db-backup-hourly"
        }
      + lifecycle_rules {
          + days_from_hiding_to_deleting = 365
          + file_name_prefix             = "tmeit-db-backup-daily"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + b2-db-backup-bucket = "tmeit-db-backups"
  + b2-db-key-id        = (known after apply)
  + b2-db-key-secret    = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*